# FilterStringGreater Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringGreater Constructor
FilterStringGreater Class See Also
---
Constructs an instance of FilterStringGreater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterStringGreater()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterStringGreater()
```

# See Also
FilterStringGreater Class
Autodesk.Revit.DB Namespace